#  3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.
n = str()
while n.isdigit() == False:
    n = input("Введите номер месяца в виде целого числа (от 1 до 12): ")
n = int(n)

vg_l = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
vg_d = {1: "зима", 2: "зима", 12: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень"}
print(f"Решение через list: {vg_l[n-1]}")
print(f"Решение через dict: {vg_d.get(n)}")

